Repository: partio-scout/pof-frontend
Catalog: content/themes/custom/languages/*.po
Languages: fi

source: Main Menu
fi: Päävalikko

source: Header images
fi: Otsakekuvat

source: Header image
fi: Otsakekuva

source: Add new
fi: Lisää uusi

source: Add new header image
fi: Lisää uusi otsakekuva

source: Edit header image
fi: Muokkaa otsakekuvaa

source: New header image
fi: Uusi otsakekuva

source: All header images
fi: Kaikki otsakekuvat

source: View header image
fi: Näytä otsakekuva

source: Find header images
fi: Etsi otsakekuvia

source: No header images found
fi: Ei otsakekuvia

source: No header images in trash
fi: Ei otsakekuvia roskakorissa

source: Tips
fi: Vinkit

source: All Tips
fi: Vinkit

source: Add New Tip
fi: Lisää vinkki

source: Add New
fi: Lisää uusi

source: View Tips
fi: Vinkit

source: Featured Image
fi: Otsakekuva

source: Set featured image
fi: Uusi otsakekuva

source: Use as featured image
fi: Otsakekuva

source: Tips list
fi: Vinkit

source: Post Type Description
fi: Kuvaus

source: Selectable
fi: Valinnaiset

source: Obligatory
fi: Pakolliset

source: Execution and goals
fi: Toteutus ja tavoitteet

source: Additional information
fi: Lisätiedot

source: Equipment
fi: Tarvikkeet

source: Task group
fi: Aktiviteettiryhmä

source: Paraller
fi: Rinnakkaiset

source: Choose
fi: Valitse

source: Skill areas
fi: Taitoalueet

source: Comments
fi: Kommentit

source: Keywords
fi: Avainsanat

source: Preparation
fi: Valmistelu

source: Length
fi: Kesto

source: Level
fi: Taso

source: Leaders task
fi: Johtajan tehtävä

source: Leadership skills
fi: Johtamistaito

source: Group size
fi: Ryhmäkoko

source: Place
fi: Paikka

source: Educational goals
fi: Kasvatustavoitteet

source: Goal
fi: Tavoite

source: Description
fi: Kuvaus

source: Attachments
fi: Liitteet

source: Pictures
fi: Kuvat

source: Documents
fi: Tiedostot

source: Links
fi: Linkit

source: Front page
fi: Etusivu

source: Back up
fi: Takaisin ylös

source: Sitemap
fi: Sivukartta

source: Search
fi: Haku

source: Use the advanced search
fi: Käytä tarkempaa hakua

source: Filter the results
fi: Rajaa Hakutuloksia

source: Filter by agegroup
fi: Rajaa ikäkauden mukaan

source: By agegroup
fi: Ikäkauden mukaan

source: More filters
fi: Lisää rajausvaihtoehtoja

source: Other filters
fi: Muut Rajausvaihtoehdot

source: Filter type
fi: Rajaustapa

source: And
fi: Ja

source: Or
fi: Tai

source: Load more
fi: Lataa lisää

source: results found
fi: hakutuloksia

source: Frontpage
fi: Etusivu

source: Search results
fi: Hakutulokset

source: Tell us what you are looking for..
fi: Kerro, mitä etsit..

source: Search on site
fi: Etsi sivulta

source: Order
fi: Järjestys

source: Latest
fi: Uusimmat

source: Most popular
fi: Suosituimmat

source: Show more
fi: Näytä lisää

source: Add a tip
fi: Lisää vinkki

source: Send
fi: Lähetä

source: Name
fi: Vinkin lähettäjän nimi

source: Title
fi: Otsikko

source: Write your tips here
fi: Kirjoita vinkkisi tähän

source: Add an attachment
fi: Lisää liite
